---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.BraceParallelLineOffset
source: html/66fb3510-3fc7-d80b-9515-3593e1459e81.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.BraceParallelLineOffset Property

The distance by which brace symbols in plan
 views will be offset.

## Syntax (C#)
```csharp
public double BraceParallelLineOffset { get; set; }
```

## Remarks
Applies only when BracePlanRepresentation is set to ParallelLine.